Revit 2026 API

# ConduitSizes Methods

---

The ConduitSizes type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Contains | Checks whether a conduit size with the nominal diameter exists. |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetBasicIEnumerator | Returns an enumerator that iterates through a collection. |
|  | GetConduitSizesIterator | Returns a ConduitSizeIterator to the conduit sizes. |
|  | GetEnumerator | Returns an enumerator that iterates through a collection. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

ConduitSizes Class

Autodesk.Revit.DB.Electrical Namespace